PDL/tut.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-11 Fri 22:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Tut</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Fernando Ania" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../readTheOrg/css/readtheorg.css" />x
</head>
<body>
<div id="content">
<h1 class="title">Tut</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline3">1. Question 1</a>
<ul>
<li><a href="#orgheadline1">1.1. Show that the replacement does not change what the program is doing.</a></li>
<li><a href="#orgheadline2">1.2. Do the replacement in a command</a></li>
</ul>
</li>
<li><a href="#orgheadline6">2. Question 2</a>
<ul>
<li><a href="#orgheadline4">2.1. Describe the operator ||</a></li>
<li><a href="#orgheadline5">2.2. What are the possible results?</a></li>
</ul>
</li>
<li><a href="#orgheadline8">3. Lab</a>
<ul>
<li><a href="#orgheadline7">3.1. ex1</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">1</span> Question 1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Show that the replacement does not change what the program is doing.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<i>in an expression</i>
</p>

<p>
<br  />
We look in each case to see if it is safe.
if it is a reference to memory
</p>

<p>
<b>Safe</b>
if E = !x
E' = 1
</p>

<p>
<b>Safe</b> as there is nothing to replace
E = !y
E'= !y
</p>


<p>
<b>safe</b> as not changing the results
</p>

<p>
E = E1 op E2
E' = E1' op E2'
E = 1 op 2
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Do the replacement in a command</h3>
<div class="outline-text-3" id="text-1-2">
<p>
command could be anything
</p>

<p>
x = 1, [x-&gt;2, if x=2]
</p>

<p>
command can change the value therefore it is not safe
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">2</span> Question 2</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.1</span> Describe the operator ||</h3>
<div class="outline-text-3" id="text-2-1">
<p>
c1 || c2
</p>

<p>
if c1 can execute a transition it will do so. Same for c2 in any order.
</p>

<p>
deterministic = if it reaches a result, this result must be unique
</p>

<p>
Non deterministic as we have to cases of the rules. Therefore we can't ensure a unique result.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.2</span> What are the possible results?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
[x=0 then y= !y+1]   &there4; x=0 &amp; y=2.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
C1 || C2
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
&lt;x=1, s&gt; -&gt; &lt;skip, s[x-&gt;1]&gt;
</p>


<p>
if we start with c1 then we get 1
if we start with c2 then we get x = 1 and y =2. As after doing c1 x becomes 1.
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">3</span> Lab</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">3.1</span> ex1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
quad x = x*x*x*x
quad = square . square
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fernando Ania</p>
<p class="date">Created: 2016-03-11 Fri 22:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
